export const chemotechData = [
	{
		question: 'Санау жүйесі бөлінеді:',
		a: 'позициялық және позициялық емес',
		correct: 'a',
	},
	{
		question:
			'Сандық техника мен сандық құрылғыларда қолданылатын санау жүйесі:',
		a: 'екілік',
		correct: 'a',
	},
	{
		question: 'Сегіздік санау жүйесі:',
		a: '0,1,2,3,4,5,6,7',
		correct: 'a',
	},
	{
		question: 'Ондық санау жүйесі:',
		a: '0,1,2,3,4,5,6,7,8,9',
		correct: 'a',
	},
	{
		question: 'Оналтылық санау жүйесі:',
		a: '0,1,2,3,4,5,6,7,8,9,A,B,C,D,E,F',
		correct: 'a',
	},
	{
		question: 'Екілік санау жүйесі:',
		a: '0,1',
		correct: 'a',
	},
	{
		question:
			'Сандарды ондық санау жүйесінен екілік санау жүйесіне ауыстыру үшін:',
		a: 'Бүтін ондық санды екілік санау жүйесіне ауыстыру үшін санды 2-ге бөлу керек.',
		correct: 'a',
	},
	{
		question: 'Логика алгебрасының бастапқы ұғымы:',
		a: 'пікір',
		correct: 'a',
	},
	{
		question: 'Пікір мына топқа бөлінеді:',
		a: 'Жоқ вариантов (по запросу)',
		correct: 'a',
	},
	{
		question: 'ЕМЕС функциясы:',
		a: 'инверсия',
		correct: 'a',
	},
	{
		question: 'Логикалық қосу дегеніміз:',
		a: 'дизъюнкция',
		correct: 'a',
	},
	{
		question: 'Дизюнкция дегеніміз:',
		a: 'Логикалық қосу',
		correct: 'a',
	},
	{
		question: 'ЖӘНЕ функциясысын көрсетіңіз:',
		a: '⋀',
		correct: 'a',
	},
	{
		question: 'Логикалық көбейту дегеніміз:',
		a: 'конъюнкция',
		correct: 'a',
	},
	{
		question: 'Конъюнкция дегеніміз:',
		a: 'Логикалық көбейту',
		correct: 'a',
	},
	{
		question: 'ЕМЕС қандай логикалық элемент:',
		a: 'логикалық жалған',
		correct: 'a',
	},
	{
		question: 'Логикалық қосудың шартты белгісі:',
		a: 'V',
		correct: 'a',
	},
	{
		question: 'Логикалық көбейтудің шартты белгісі:',
		a: '⋀',
		correct: 'a',
	},
	{
		question: 'Сигнал түрлері:',
		a: 'аналогтық, сандық, импульстік, шулар, аралас',
		correct: 'a',
	},
	{
		question: 'Цифрлық сигнал қабылдайтын мән:',
		a: '0 және 1',
		correct: 'a',
	},
	{
		question: 'Аналогты сигналды сандық сигналға аудару үшін не қолданылады?',
		a: 'Жоқ вариантов (по запросу)',
		correct: 'a',
	},
	{
		question: 'D триггер дегеніміз:',
		a: 'Жоқ вариантов (по запросу)',
		correct: 'a',
	},
	{
		question: 'Шифратор схемада былай белгіленеді:',
		a: 'CD',
		correct: 'a',
	},
	{
		question:
			'Сигналды бірнеше кірістен бір шығысқа кезек-кезек беруге арналған сандық құрылғы:',
		a: 'мультиплексор',
		correct: 'a',
	},
	{
		question: 'НЕМЕСЕ элемені қалай белгіленеді?:',
		a: 'V',
		correct: 'a',
	},
	{
		question: 'Дешифратор?',
		a: ' бұл цифрлық құрылғы, ол кодталған (сандық) кіріс сигналдарын декодтап, белгілі бір логикалық шығыс сигналын белсенді етеді ',
		correct: 'a',
	},
	{
		question: 'Шифратор:',
		a: 'бұл цифрлық құрылғы, ол бірнеше кіріс сигналдарын қабылдап, оларды қысқартылған (кодталған) формада бір немесе бірнеше шығуға түрлендіреді',
		correct: 'a',
	},
	{
		question: 'Логикалық амалдарда қолданылатын конъюнкция белгісі:',
		a: '∧ немесе ЖӘНЕ',
		correct: 'a',
	},
	{
		question: 'Күшейткіш дегеніміз не?',
		a: 'Күшейткіш — электрондық құрылғы, оның негізгі функциясы әлсіз электр сигналдарының амплитудасын (күшін) ұлғайту',
		correct: 'a',
	},
	{
		question: 'ОЗУ деген не?',
		a: 'Бұл компьютердің немесе басқа есептеуіш құрылғылардың жұмыс істеп тұрған бағдарламалары мен уақытша деректерді сақтау үшін қолданылатын жылдам, ұшқыр жады түрі.',
		correct: 'a',
	},
	{
		question:
			'Логикалық функцияның аналитикалық өрнегінде айнымалылар санын немесе:',
		a: 'Жоқ вариантов (по запросу)',
		correct: 'a',
	},
	{
		question:
			'Шығыс сигналында 1 бит ақпаратты жадта сақтайтын қарапайым жады түрі не деп аталады?',
		a: 'триггер',
		correct: 'a',
	},
	{
		question: 'Clock тактілік кірісі нені білдіреді?',
		a: 'бұл сандық жүйелер мен құрылғыларда уақыттың белгілі бір интервалдары бойынша жұмыс істеуді басқару үшін қолданылатын сигнал.',
		correct: 'a',
	},
	{
		question: 'RS триггері қандай логикалық элемент негізінде құрылған?',
		a: 'ЕМЕС, ЖӘНЕ, ЕМЕС',
		correct: 'a',
	},
	{
		question: 'RS триггерінің ерекшелігі:',
		a: 'Екі тұрақты күй: RS триггері екі тұрақты күйде жұмыс істейді: 1 (орнатылған) және 0 (тазартылған). Бұл оның ақпаратты сақтауға мүмкіндік беретін негізгі ерекшелігі.',
		correct: 'a',
	},
	{
		question: 'JK триггерінің RS триггерінен айырмашылығы:',
		a: '1. Жұмыс принципі: ● RS триггері тек екі кіріс сигналына (S — Set және R — Reset) негізделген және олардың арақатынасында кейбір шектеулер бар. Мысалы, S = 1 және R = 1 жағдайы әдетте қате болып саналады, себебі екі күйді бір уақытта орнатуға тырысады. ● JK триггері де екі кіріс сигналына (J және K) негізделген, бірақ ол екі кірістің бір уақытта 1 болуы жағдайында да дұрыс жұмыс істей алады.',
		correct: 'a',
	},
	{
		question: 'ТВ маркировкасы қандай микросхемада көрсетіледі?',
		a: 'ТВ маркировкасы — бұл микросхема немесе электрондық компоненттің белгілі бір типі немесе моделі үшін пайдаланылатын белгі.',
		correct: 'a',
	},
	{
		question: 'Ақпаратты сақтайтын құрылғы',
		a: 'жедел жады,тқрақты жады,қатты диск,SSD,флеш-жады,оптикалық диск және лента немесе таспалық жады',
		correct: 'a',
	},
	{
		question: 'Регистр тұрғызу үшін ең кең қоданылатын триггер түрі',
		a: 'D-триггері',
		correct: 'a',
	},
	{
		question: 'Регистр неше режимде жұмыс жасайды',
		a: '3 режимде: сақтау, жазу, оқу',
		correct: 'a',
	},
	{
		question: 'Тұрғызылуы бойынша регистр 2 топқа бөлінеді:',
		a: 'параллель жіне тізбекті',
		correct: 'a',
	},
	{
		question: 'Триггер шығыс сигналында қанша бит ақпаратты сақтайды?',
		a: 'бір бит',
		correct: 'a',
	},
	{
		question: 'RS триггеріндегі «RS» дегеніміз',
		a: 'R-reset S-set',
		correct: 'a',
	},
	{
		question: 'Бірнеше кірісі және бір шығысы бар комбинациялық схема?',
		a: 'мультиплексор, шифратор және дешифратор',
		correct: 'a',
	},
	{
		question: 'Екілік сигналды керек сигналға ауыстыратын құрылғы',
		a: 'дешифратор',
		correct: 'a',
	},
	{
		question: 'Біздің сигналымызды екілік сигналға ауыстырады',
		a: 'шифратор',
		correct: 'a',
	},
	{
		question: 'Регистр',
		a: 'бұл бірнеше бит ақпаратты сақтау үшін қолданылатын сандық құрылғы.',
		correct: 'a',
	},
	{
		question: 'Бір ақпараттық кірісі бар триггер',
		a: 'D, T триггер',
		correct: 'a',
	},
	{
		question: 'Синхронды триггерде С немесе Clock(CLK) нені білдіреді?',
		a: 'бұл тактілік сигнал немесе сағат сигналы, ол триггердің жұмысын синхрондайды',
		correct: 'a',
	},
	{
		question: 'ЖӘНЕ функциясы',
		a: 'логикалық көбейту',
		correct: 'a',
	},
	{
		question: 'Мультиплексорде D нені білдіреді?',
		a: 'Деректер кірісі',
		correct: 'a',
	},
	{
		question: 'Мультиплексорде S нені білдіреді?',
		a: 'рұқсат беруші кіріс',
		correct: 'a',
	},
	{
		question: 'Регистрде G1, G2 нені білдіреді?',
		a: 'рұқсат беруші кіріс',
		correct: 'a',
	},
	{
		question: 'Регистрде М, N нені білдіреді?',
		a: 'күйге әсер ететін кіріс',
		correct: 'a',
	},
	{
		question: 'Логика бойынша пікір былай анықталады.',
		a: 'бұл нақты немесе жалған мәнге ие болатын ұсыныс немесе тұжырым',
		correct: 'a',
	},
	{
		question:
			'Физикалық пікір өткізгішке электрлік токпен яғни электрлік сигналмен анықталады:',
		a: '',
		correct: '',
	},
	{
		question:
			'Екі пікір екеуі де ақиқат болған жағдайда, басқа жағдайда жалған болатын операция',
		a: 'ЖӘНЕ',
		correct: 'a',
	},
	{
		question: 'Ең болмағанда бір пікір ақиқат болғанда ақиқат болатын операция',
		a: 'НЕМЕСЕ',
		correct: 'a',
	},
	{
		question:
			'Бір пікірде ғана қолданылатын, яғни ақиқат болса жалған мән шығаратын пікір',
		a: '',
		correct: '',
	},
	{
		question: 'Комбинациялық сызбаны іске асыру үшін қолданылады',
		a: 'бұл кірістер мен шығыстар арасындағы байланыс, мұнда шығыс тек кірістердің ағымдағы мәндеріне байланысты болады',
		correct: 'a',
	},
	{
		question: 'Мультиплексорда адрестік кірістер',
		a: 'A0, A1',
		correct: 'a',
	},
	{
		question: 'Логика алгебрасының атасы',
		a: 'Джордж Буль',
		correct: 'a',
	},
	{
		question: 'Бульдік алгебраның негізгі операциялары',
		a: 'ЖӘНЕ, ЕМЕС, НЕМЕСЕ, XOR, НЕМЕСЕ ЕМЕС, ЖӘНЕ ЕМЕС',
		correct: 'a',
	},
	{
		question: 'Дизъюнкция',
		a: 'логикалық қосу',
		correct: 'a',
	},
	{
		question: 'Конъюнкция',
		a: 'логикалық көбейту',
		correct: 'a',
	},
	{
		question: 'Инверсия',
		a: 'логикалық жалған немесе терістеу',
		correct: 'a',
	},
	{
		question: 'НЕМЕСЕ операциясының белгісі',
		a: 'V',
		correct: 'a',
	},
	{
		question: 'ЖӘНЕ операциясы үшін қолданылатын белгі',
		a: '∧',
		correct: 'a',
	},
	{
		question: 'Бір кіріс бір шығыс сигнал болатын операция',
		a: 'ЕМЕС',
		correct: 'a',
	},
	{
		question:
			'Әрбір пікірге түпнұсқаға қарама –қайшы келетін пікірді идентификациялайтын логикалық операция деп атайды',
		a: 'ЕМЕС',
		correct: 'a',
	},
	{
		question:
			'Компьютер құрылғыларының жұмысын сипаттайтын кез келген логикалық функцияны іске асыратын электрондық құрылғы',
		a: 'логикалық элемент',
		correct: 'a',
	},
	{
		question: 'Катод?',
		a: 'бұл электр тізбегіндегі екі негізгі электродтың бірі, ол электр тогының ағыны бойынша теріс полярлықта орналасады.',
		correct: 'a',
	},
	{
		question: 'Сигнал дегеніміз не?',
		a: 'бұл ақпаратты беру немесе қабылдау үшін қолданылатын физикалық шама немесе құбылыс.',
		correct: 'a',
	},
	{
		question: 'RS триггері үшін тыйым салынған күйлердің қайсысы?',
		a: 'тік кірістіде: 1 1 инверстелген: 0 0',
		correct: 'a',
	},
	{
		question: 'Цифрлық компаратор дегеніміз',
		a: 'екі санды салыстыратын цифрлық құрылғы екі аналогтық сигналды сигналды салыстыратын электронды құрылғы',
		correct: 'a',
	},
	{
		question: 'Синхронды сигнал кірісі',
		a: 'бұл жүйедегі немесе құрылғыдағы уақыттың белгілі бір тактілік жиілігіне (тактілік сигналға) сәйкес келетін кіріс',
		correct: 'a',
	},
	{
		question: 'Анод?',
		a: 'лектр тізбегіндегі екі негізгі электродтың бірі, ол электр тогы ағыны бойынша оң полярлықта орналасады',
		correct: 'a',
	},
	{
		question:
			'RS триггерді іске асыру үшін қандай логикалық элементтерді қолданамыз.',
		a: 'ЖӘНЕ, НЕМЕСЕ , ЕМЕС',
		correct: 'a',
	},
	{
		question: 'D триггерінде D дегеніміз',
		a: 'Data немесе Delay',
		correct: 'a',
	},
	{
		question:
			'Синхронды RS триггер мен асинхронды RS триггерді қалай ажыратамыз',
		a: 'Синхронды RS триггер мен асинхронды RS триггерінің басты айырмашылықтары олардың тактілік сигналға немесе таймингке байланысты әрекет етуінде.',
		correct: 'a',
	},
	{
		question: 'JK триггері',
		a: 'JK триггері — бұл жадты сақтауға арналған және екі күйде жұмыс істейтін логикалық құрылғы. Ол RS триггерінің жетілдірілген нұсқасы болып табылады және көбінесе сандық схемаларда, есептеуіш құрылғыларда, есептерде және сәттіліктерді синхрондауда қолданылады.',
		correct: 'a',
	},
	{
		question: 'D триггер қандай логилкалық элемент негізінде тұрғызылған',
		a: 'ЖӘНЕ ЕМЕС, ЖӘНЕ НЕМЕСЕ немесе ЕМЕС',
		correct: 'a',
	},
	{
		question:
			'Electronic Workbench ортасында Word generator –да қадамдық жұмыс режимін қалай атаймыз',
		a: 'Step',
		correct: 'a',
	},
	{
		question:
			'Electronic Workbench ортасында Word generator –да цикдік жұмыс режимін қалай атаймыз',
		a: 'Burst немесе Cycle',
		correct: 'a',
	},
	{
		question:
			'Триггердің тізбектей және параллель қосылу негізінде тұрғызылған, ақпаратты сақтау үшін арналған құрылғы',
		a: 'регистр',
		correct: 'a',
	},
	{
		question: 'D триггерлер негізінде құрылатын құрылғы',
		a: 'регистрлер және санауыштар(счетчики)',
		correct: 'a',
	},
	{
		question: 'Параллель регистр қандай сөзді есте сақтап қалады',
		a: 'бірнеше биттен тұратын ақпаратты бірден сақтай алатын құрылғы',
		correct: 'a',
	},
	{
		question:
			'Параллель регистрде ақпаратты жазған кезде барлық биттер(екілік разрядтар) былай жазылады',
		a: 'барлық биттер бір уақытта жазылады',
		correct: 'a',
	},
	{
		question: 'Сандық-аналогтық түрлендіргіш',
		a: '-бұл сандық (цифрлық) сигналды аналогтық сигналға түрлендіретін құрылғы',
		correct: 'a',
	},
	{
		question:
			'ақпаратты сандық қалпынан аналогтық дабылға түрлендіру үшін арналған құрылғы',
		a: 'Сандық-аналогтық түрлендіргіш',
		correct: 'a',
	},
	{
		question: 'Арифметикалық-логикалық құрылғы',
		a: 'кіріс сандарына түрлі арифметикалық және логикалық операциялар жасайтын көп функционалды құрылғы',
		correct: 'a',
	},
	{
		question:
			'Кіріс сандарына түрлі арифметикалық және логикалық операциялар жасайтын көп функционалды құрылғы',
		a: 'Арифметикалық-логикалық құрылғы',
		correct: 'a',
	},
	{
		question: 'Басқару құрылғысы',
		a: 'микропроцессордың барлық түйіндер жұмысын басқарады',
		correct: 'a',
	},
	{
		question: 'Микропроцессордың барлық түйіндер жұмысын басқарады',
		a: 'Басқару құрылғысы',
		correct: 'a',
	},
	{
		question:
			'Ішкі құрылым бойынша микропроцессорларды құрастырудың екі негізгі принципін анықтайды',
		a: 'CISC, RISC',
		correct: 'a',
	},
	{
		question: 'Қазіргі уақытта тізбекті порттардың екі түрі кең қолданылады',
		a: 'RS 232, USB',
		correct: 'a',
	},
	{
		question:
			'Бинарлы сөзі қандай мағына береді? Бұл екілік жүйедегі (бинарлық) цифрлардан тұратын сөз.',
		a: 'Әдетте, бинарлы сөз 0 және 1 цифрларынан (биттерінен) құралады',
		correct: 'a',
	},
	{
		question: 'Қарапайым пікір екі аргументтен тұрады',
		a: 'a',
		correct: 'a',
	},
	{
		question: 'Екілік логикалық элементтерге келесі жатады',
		a: 'ЖӘНЕ, ЕМЕС, НЕМЕСЕ, XOR, НЕМЕСЕ ЕМЕС, ЖӘНЕ ЕМЕС',
		correct: 'a',
	},
	{
		question: 'ЕМЕС элементтері логикалық жоққа шығаруды',
		a: 'Инверсия',
		correct: 'a',
	},
	{
		question: 'Шифраторды кейде былай атайды',
		a: 'кодер',
		correct: 'a',
	},
	{
		question: 'Дешифраторды кейде былай атайды',
		a: 'декодер',
		correct: 'a',
	},
	{
		question:
			'Бірнеше сигналды-кірісі, бір немесе бірнеше басқарушы -кірісі және бір шығысы бар құрылғы',
		a: 'мультиплексор',
		correct: 'a',
	},
	{
		question:
			'Бірнеше кірістердің ішінен бір кірісі арқылы сигналдың шығысқа өтуіне мүмкіндік беретін құрылғы',
		a: 'мультиплексор',
		correct: 'a',
	},
	{
		question:
			'Сигналды бір адрестік кірістен бірнеше шығысқа берілуін қамтамасыз ететін құрылғы',
		a: 'демультиплексор',
		correct: 'a',
	},
	{
		question: 'Демультиплексор қандай құрылғы',
		a: 'Сигналды бір адрестік кірістен бірнеше шығысқа берілуін қамтамасыз ететін құрылғы',
		correct: 'a',
	},
	{
		question: 'Импульсті есептеуіштер',
		a: 'бұл электрлік импульстарды санайтын құрылғылар.',
		correct: 'a',
	},
	{
		question: 'Мультиплексордың шартты берілуі',
		a: 'MUX',
		correct: 'a',
	},
	{
		question: 'Дешифратордың шартты белгіленуі',
		a: 'DC',
		correct: 'a',
	},
	{
		question:
			'Конъюнкцияның логикалық операциясы ...элементтің көмегімен жүзеге асырылады',
		a: 'ЖӘНЕ',
		correct: 'a',
	},
	{
		question:
			'Дизъюнкцияның логикалық операциясы ...элементтің көмегімен жүзеге асырылады',
		a: 'НЕМЕСЕ',
		correct: 'a',
	},
	{
		question: '11101, 10101 саны ...берліген деп айтуға болады',
		a: 'екілік жүйеде',
		correct: 'a',
	},
	{
		question: 'Триггер шегі дегеніміз не?',
		a: 'бұл триггердің күйін өзгерту үшін қажетті кіріс сигналының деңгейі немесе кернеу шегі.',
		correct: 'a',
	},
	{
		question:
			'… бұл сигнал кірісіне сәйкес деңгей, яғни тиісті функцияны осы сигнал арқылы орындау',
		a: 'шек сигналы',
		correct: 'a',
	},
	{
		question: 'Шина деген не?',
		a: 'бұл компьютердің немесе басқа электрондық құрылғылардың ішкі бөліктері арасындағы деректерді, адрестерді немесе басқару сигналдарын тасымалдайтын электрлік байланыс арнасы',
		correct: 'a',
	},
	{
		question: 'Шина схемада қалай көрсетіледі?',
		a: 'a',
		correct: 'a',
	},
	{
		question: 'P-N-P ж/е N-P-N транзисторлары қандай типке жатады?',
		a: 'биполярлық транзисторлар',
		correct: 'a',
	},
	{
		question: 'Сол жақтағы шалаөткізгіш облысы қалай аталады?',
		a: 'эмиттер',
		correct: 'a',
	},
	{
		question: 'Күшейткіш дегеніміз не?',
		a: 'бұл сигналдың амплитудасын немесе қуатын ұлғайтуға арналған электрондық құрылғы',
		correct: 'a',
	},
	{
		question: 'Триггер шығу саны бар?',
		a: 'екі',
		correct: 'a',
	},
	{
		question: 'Карно картасы',
		a: 'Логикалық функцияларды ыңғайлы және көрнекі қолмен кішірейту мақсатында көрсетудің графикалық тәсілі',
		correct: 'a',
	},
	{
		question:
			'Логикалық функцияның аналитикалық өрнегінде айнымалылар санын немесе операцияларды кішірейту процедурасы',
		a: 'кешірейту',
		correct: 'a',
	},
	{
		question:
			'Карно картасы көмегімен функцияны кішірейту реті келесідей іске асады:',
		a: 'қадамдар',
		correct: 'a',
	},
	{
		question: 'Аналогтық сигналдар мен аналогтық электрониканың кемшілігі',
		a: 'құрылғының тиімсіздігі',
		correct: 'a',
	},
	{
		question: 'Әрекет ету принципіне сәйкес транзисторлар бөлінеді',
		a: 'биполярлы,өрістік,IGBT,фотоэлектрлі',
		correct: 'a',
	},
	{
		question: 'Биполярлық транзисторлар мындай типті транзисторларға бөлінеді',
		a: 'n-p-n,p-n-p',
		correct: 'a',
	},
	{
		question:
			'Электр тербелістерін күшейтуге, оларды тудыруға және түрлендіруге арналып жартылай өткізгіш кристалл негізінде жасалған электрондық құрал',
		a: 'транзистор',
		correct: 'a',
	},
	{
		question: 'Сумматор дегеніміз',
		a: 'бұл цифрлық схемаларда екі немесе одан да көп екілік сандарды қосу үшін қолданылатын логикалық құрылғы.',
		correct: 'a',
	},
	{
		question: 'СДНФ',
		a: 'толық атауы: сәулеленген дизъюнктивті қалыпты форма) — бұл логикалық функцияның дизъюнктивті (логикалық қосу, OR) түрінде жазылған стандартты формасы, онда функция тек ақиқат мәндерін (1) сипаттайтын минтермдердің қосындысы ретінде беріледі.',
		correct: 'a',
	},
	{
		question: 'СКНФ',
		a: 'толық атауы: сәулеленген конъюнктивті қалыпты форма) — бұл логикалық функцияның конъюнктивті (логикалық көбейту, AND) түрінде жазылған стандартты формасы, онда функция тек жалған мәндерін (0) сипаттайтын макстермдердің көбейтіндісі ретінде беріледі.',
		correct: 'a',
	},
	{
		question: 'Шифратор түрлері',
		a: 'қарапайым, басымдық, лешифраторөшфиратор, дара цифрлық, рұқсат беруші, оптикалық',
		correct: 'a',
	},
	{
		question: 'Дешифратор түрлері',
		a: 'қарапайым, рұқсат берішу, ондық, екілік, сегменттік, каскадталған, ASCII',
		correct: 'a',
	},
	{
		question: 'Транзисторлар – ....',
		a: 'жартылай өткізгіш материалдар негізінде жасалған және электрлік сигналдарды күшейтетін немесе қосатын құрылғылар',
		correct: 'a',
	},
	{
		question:
			'Ең көп таралған транзисторлар деп аталатын екі n–p түйіспесі бар ...., өйткені олардың жұмысы екі белгінің заряд тасымалдаушыларын пайдалануға негізделген',
		a: 'биполярлық транзисторлар.',
		correct: 'a',
	},
	{
		question: 'биполярлық транзисторда ... n-p-түйісу бар.',
		a: 'екі',
		correct: 'a',
	},
	{
		question: 'биполярлық транзистор қабаттарының дұрыс ретін табыңыз',
		a: 'Эмиттер (E) → Баз (B) → Коллектор (C).',
		correct: 'a',
	},
	{
		question: 'Транзисторлар қандай негізгі кластарға бөлінеді?',
		a: 'Биполярлық транзисторлар (BJT). Полевой транзисторлар (FET).',
		correct: 'a',
	},
	{
		question: 'биполярлық транзистордың шығыстары қалай аталады?',
		a: 'Эмиттер, Баз және Коллектор.',
		correct: 'a',
	},
	{
		question: 'Күшейткіш дегеніміз не?',
		a: 'сигналдың амплитудасын арттыруға арналған электрондық құрылғы.',
		correct: 'a',
	},
	{
		question:
			'Төменде көрсетілгендірдің қайсысы компьютердің шығару құрылғысы болып табылады?',
		a: 'Монитор, Принтер, Динамик. сондай сияқты құрылғылар',
		correct: 'a',
	},
	{
		question: 'CPU деген не?',
		a: 'компьютердің негізгі процессоры, ол барлық есептеулер мен басқару операцияларын орындайды.',
		correct: 'a',
	},
	{
		question:
			'жартылай өткізгіш құрылғылар, олар қуатты күшейтуге жарамды және үш немесе одан да көп терминалдары бар.',
		a: 'Транзисторлар',
		correct: 'a',
	},
	{
		question: 'функцияны дизъюнкциялардың конъюнкиясы түрінде көрсету әдісі',
		a: 'СДНФ',
		correct: 'a',
	},
	{
		question: 'Триггер түрлері',
		a: 'RS-триггер, D-триггер, JK-триггер, T-триггер.',
		correct: 'a',
	},
	{
		question:
			'Екі орнықты күйі бар және бір күйден келесіге ауыстыратын сыртқы әсерді алып тастаған соң ол күйлердің біреуін керекті уа қытқа сақтайтын құрылымды не деп атайды',
		a: 'Триггер',
		correct: 'a',
	},
	{
		question: 'тізбекті қосылысты схемаларға мыналар жатады',
		a: 'Ширатқыштар, Триггерлер, Регистрлер.',
		correct: 'a',
	},
	{
		question: 'Ақпаратты жазу тәсіліне байланысты триггерлер',
		a: 'Жазу басқару кірісі бар триггерлер',
		correct: 'a',
	},
	{
		question: 'Синхронды триггерлерде ақпарат ненің әсерімен жазылады.',
		a: 'Сағат сигналымен.',
		correct: 'a',
	},
	{
		question: 'есептік кірістері бар триггерлер',
		a: 'Кіріс ақпараты сағат сигналына сәйкес жазылады',
		correct: 'a',
	},
	{
		question: 'ақпаратты кірісті қабылдайтын триггерлер',
		a: 'D-триггерлер',
		correct: 'a',
	},
	{
		question: 'R және S кірістерге бөлінген бақылаулары бар триггерлер',
		a: 'RS-триггерлер',
		correct: 'a',
	},
	{
		question: 'D триггерлер келесі негізгі операцияларды орындауға арналған',
		a: 'Ақпаратты жазу және сақтау.',
		correct: 'a',
	},
	{
		question:
			'бұл n разрядтік екілік мәліметтерді қабылдауға, сақтауға және оқуға, сондай-ақ оларды түрлендіруге арналған электрондық құрылғы',
		a: 'Регистр',
		correct: 'a',
	},
	{
		question:
			'Деректерді қабылдау және беру тәсілі бойынша регистрлердің түрлері',
		a: 'Параллельді және тізбекті',
		correct: 'a',
	},
	{
		question:
			'Деректерді түрлендіру немесе логикалық операцияларды орындау функциясының белгісі бойынша регистр түрлері',
		a: 'Логикалық регистрлер, Арифметикалық регистрлер',
		correct: 'a',
	},
	{
		question: 'Деректерді жазуды басқару бойынша регистрлерді былай бөледі:',
		a: 'Жазуды басқару кірісі бар регистрлер',
		correct: 'a',
	},
	{
		question:
			'нөлдік кодты жазуға, параллель түрде енгізілетін ақпаратты жазуға, ақпаратты сақтауға және параллель түрде сақталған ақпаратты шығаруға арналған сандық құрылғы',
		a: 'Регистр',
		correct: 'a',
	},
	{
		question: 'регистрлер',
		a: 'нөлдік кодты жазуға, параллель түрде енгізілетін ақпаратты жазуға, ақпаратты сақтауға және параллель түрде сақталған ақпаратты шығаруға арналған сандық құрылғы',
		correct: 'a',
	},
	{
		question:
			'сигналды бір ақпарат енгізуінен n ақпарат шығысының біріне ауыстыруға арналған сандық құрылғы',
		a: 'Мультиплексор',
		correct: 'a',
	},
	{
		question:
			'сигналды бірнеше кірістен бір шығысқа кезек-кезек беруге арналған сандық құрылғы',
		a: 'Демультиплексор',
		correct: 'a',
	},
	{
		question:
			'басқару құрылғысының (БҚ) басқаруымен бұл жағдайда операндтар деп аталатын мәліметтерге арифметикалық және логикалық түрлендірулерді (элемен- тардан бастап) жүргізуге қызмет ететін процессорлық қондырғы',
		a: 'Арифметикалық және логикалық құрылғы (ALU)',
		correct: 'a',
	},
	{
		question: 'Арифметикалық және логикалық құрылғы',
		a: 'басқару құрылғысының (БҚ) басқаруымен бұл жағдайда операндтар деп аталатын мәліметтерге арифметикалық және логикалық түрлендірулерді (элемен- тардан бастап) жүргізуге қызмет ететін процессорлық қондырғы',
		correct: 'a',
	},
	{
		question: 'Транзисторлар',
		a: 'Жартылай өткізгіш материал негізінде жасалған, электр сигналдарын күшейтетін немесе қосатын құрылғылар',
		correct: 'a',
	},
	{
		question: 'RS-триггерлер',
		a: 'Екі орнықты күйі бар триггерлердің бір түрі',
		correct: 'a',
	},
	{
		question: 'n-p-n',
		a: 'Биполярлық транзистордың типі, екі n типті жартылай өткізгіш қабаттары арасындағы p типті қабатпен',
		correct: 'a',
	},
	{
		question:
			'екілік кодтың арифметикалық қосындысын есептейтін сандық құрылғы',
		a: 'Сумматор',
		correct: 'a',
	},
	{
		question: 'Сумматор ережесі бойынша 1+1 мәні нешеге тең',
		a: '10',
		correct: 'a',
	},
	{
		question: 'Транзистор үші электродтан тұрады:',
		a: 'Эмиттер, Баз, Коллектор',
		correct: 'a',
	},
	{
		question: 'Транзистор үш негізгі режимде жұмыс істей алады:',
		a: 'Сөндіру режимі, күшейту режимі, қосқыш режимі',
		correct: 'a',
	},
	{
		question:
			'сөздерді қабылдау, сақтау және тасымалдау операцияларын орындауға арналған құрылғы',
		a: 'Регистр',
		correct: 'a',
	},
	{
		question: 'Сөздерді жазу тәсіліне қарай регистрлер бөлінеді',
		a: 'Параллельді және тізбекті',
		correct: 'a',
	},
	{
		question: 'импульс санын есептеуге арналған құрылғы',
		a: 'счетчик',
		correct: 'a',
	},
]
